mock-example/src/test/resources/xml/BBMO/SrvSendApplicationForCBDFProcessingRq/rq2.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <mq:AsyncHeader xmlns:mq="http://sbrf.ru/prpc/mq/headers">
         <mq:message-id>message-id</mq:message-id>
         <mq:request-time>2014-12-16T17:55:06.410+04:00</mq:request-time>
         <mq:operation-name>SrvSendApplicationForCBDFProcessing</mq:operation-name>
      </mq:AsyncHeader>
   </soap:Header>
   <soap:Body>
      <tns:SrvSendApplicationForCBDFProcessingRq xmlns:tns="http://sbrf.ru/prpc/bbmo/10">
         <tns:NaturalPersonCompesationApplication>
            <tns:ApplicationId>test1</tns:ApplicationId>
            <tns:DocumentPackageType>1</tns:DocumentPackageType>
            <tns:LastName>string</tns:LastName>
            <tns:FirstName>string</tns:FirstName>
            <tns:BirthDate>2015-03-14</tns:BirthDate>
            <tns:BankSubdivision>
               <tns:TB>str</tns:TB>
               <tns:OSB>string</tns:OSB>
               <tns:VSP>string</tns:VSP>
            </tns:BankSubdivision>
            <tns:IssueDate>2015-03-14</tns:IssueDate>
         </tns:NaturalPersonCompesationApplication>
      </tns:SrvSendApplicationForCBDFProcessingRq>
   </soap:Body>
</soap:Envelope>
